sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/bl808_h264.c
#include <stdio.h>
#include <string.h>

#include "FreeRTOS.h"

#include "bl808_h264.h"
#include "vdo_reg.h"


#undef  DEBUG_MODULE
#define DEBUG_MODULE 0

#define IFRAME_MAX_QP           51
#define PFRAME_MAX_QP           51

#define DEF_NUM_SLICES          (1)

#if DEBUG_MODULE
#define DEBUG_REG() \
    vdo_reg_t *vdo_reg = (vdo_reg_t*)H264_ENC_BASE
#else
#define DEBUG_REG()
#endif

#define BL_BIT_SET(val, bit)    val | (1 << bit)

typedef enum {
    H264_CTRL_MODE_AUTO = 0,
    H264_CTRL_MODE_MANUAL = 2,
} H264_Ctrl_Mode_Type;

void H264_Reset_HW_Status(Stream_ID_Type id)
{
    uint32_t tmpVal;

    /* set reset HW internal status, including BS base, BS wr pointer, total byte cnt */
    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_H264_ENCODER_CTRL);

    /* initialize bitstream pointer to bs_base_addr, clear bs_tot_bycnt */
    H264_SET_CFG_BITS_VAL(id, tmpVal, BS_STATUS_INIT, 1);

#if (BL80X_HW_VER >= BL80X_HW_B0)
    /* as d2b_sync_en=1, reset start position of source buffer to cfg_frame_base_addr */
    H264_SET_CFG_BITS_VAL(id, tmpVal, SRC_LINE_CLR, 1);    /* Reset line cnt, which is synced with dvp2axi */
#endif
    BL_WR_REG(H264_ENC_BASE, VDO_H264_ENCODER_CTRL, tmpVal);
}

void H264_DisableCoreEnc(Stream_ID_Type id)
{
    uint32_t tmpVal;

    /* disable core enc to allow change of core configure */ 
    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG0);
    H264_SET_BITS_VAL(id, tmpVal, ENC_EN, 0);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG0, tmpVal);
}

void H264_Init(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_H264_ENCODER_CTRL);
    tmpVal = BL_SET_REG_BIT(tmpVal, VDO_CFG_CORE_CLK_EN);
    tmpVal = BL_SET_REG_BIT(tmpVal, VDO_CFG_MEM_CLK_EN);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, VDO_CFG_ENC_CTRL_MBY_IDX, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, VDO_CFG_CTRL_MODE, H264_CTRL_MODE_AUTO);
    tmpVal = BL_CLR_REG_BIT(tmpVal, VDO_CFG_FRAME_START);
    tmpVal = BL_CLR_REG_BIT(tmpVal, VDO_CFG_ENC_SEQ_EN);

#if (BL80X_HW_VER >= BL80X_HW_B0)
    tmpVal = BL_CLR_REG_BIT(tmpVal, VDO_CFG_S_FRAME_START);
    tmpVal = BL_CLR_REG_BIT(tmpVal, VDO_CFG_S_ENC_SEQ_EN);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, VDO_CFG_DUO_BS_EN, 1);
#endif

    BL_WR_REG(H264_ENC_BASE, VDO_H264_ENCODER_CTRL, tmpVal);
}

void H264_Enable_CRef(Stream_ID_Type id, BL_Fun_Type enable)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_H264_ENCODER_CTRL);
    H264_SET_CFG_BITS_VAL(id, tmpVal, CREF_EN, (enable ? 0x01 : 0x00));
    BL_WR_REG(H264_ENC_BASE, VDO_H264_ENCODER_CTRL, tmpVal);
}

void H264_SetDualEnc(BL_Fun_Type newState)
{
#if (BL80X_HW_VER >= BL80X_HW_B0)
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_H264_ENCODER_CTRL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, VDO_CFG_DUO_BS_EN, ((newState == ENABLE) ? 0x01 : 0x00));
    BL_WR_REG(H264_ENC_BASE, VDO_H264_ENCODER_CTRL, tmpVal);
#endif
}

void H264_SetSwMode(BL_Fun_Type newState)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_H264_ENCODER_CTRL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, VDO_CFG_CTRL_MODE, 
        ((newState == ENABLE) ? H264_CTRL_MODE_MANUAL : H264_CTRL_MODE_AUTO));
    BL_WR_REG(H264_ENC_BASE, VDO_H264_ENCODER_CTRL, tmpVal);
}

void H264_SetLineBufferAddr(uint32_t addr)
{
    BL_WR_REG(H264_ENC_BASE, VDO_H264_LB_BASE_ADDR, addr);
}

void H264_SetResolution(Stream_ID_Type id, uint32_t width, uint32_t height)
{
    uint32_t tmpVal = 0;

    /* validate input param */
    CHECK_PARAM((width < 2048) && (height < 2048));
    CHECK_PARAM(IS_MULTIPULE_OF_8(height));

    H264_RD_REG(id, tmpVal, VDO_H264, FRAME_SIZE);
    H264_SET_CFG_BITS_VAL(id, tmpVal, FRAME_WIDTH, width);
    H264_SET_CFG_BITS_VAL(id, tmpVal, FRAME_HEIGHT, ENC_HEIGHT(height));
    H264_WR_REG(id, tmpVal, VDO_H264, FRAME_SIZE);

    H264_RD_REG(id, tmpVal, VDO, PADDING_CTRL);
    if (!IS_MULTIPULE_OF_16(height)) {
        H264_SET_BITS_VAL(id, tmpVal, Y_LINE_PAD, 8);
        H264_SET_BITS_VAL(id, tmpVal, Y_PADDING_PIXEL, 0x0);
        H264_SET_BITS_VAL(id, tmpVal, U_PADDING_PIXEL, 0x80);
        H264_SET_BITS_VAL(id, tmpVal, V_PADDING_PIXEL, 0x80);
    } else {
        H264_SET_BITS_VAL(id, tmpVal, Y_LINE_PAD, 0);
    }
    H264_WR_REG(id, tmpVal, VDO, PADDING_CTRL);
}

void H264_SetSrcFrameBuf(Stream_ID_Type id, H264_SRC_BUF_CFG_S *src_buf, uint16_t src_h, uint16_t h)
{
    uint32_t tmpVal;

    /* check if src height is too big (more than double 1088 height) */
    //CHECK_PARAM(src_h <= 2176);

    /* check if buffer is aligned to 128 bytes boundary */
    CHECK_PARAM((src_buf->yBufAddr & AXI_BURST_INCR16_ALIGNMENT_MASK) == 0 );
    CHECK_PARAM((src_buf->uvBufAddr & AXI_BURST_INCR16_ALIGNMENT_MASK) == 0 );

    H264_WR_REG(id, src_buf->yBufAddr, VDO_H264, FRAME_BASE_ADDR_Y);
    H264_WR_REG(id, src_buf->uvBufAddr, VDO_H264, FRAME_BASE_ADDR_UV);

    H264_RD_REG(id, tmpVal, VDO_H264, SRC_BF_HEIGHT);
    H264_SET_CFG_BITS_VAL(id, tmpVal, Y_SRC_BF_HEIGHT, src_h);
    H264_SET_CFG_BITS_VAL(id, tmpVal, C_SRC_BF_HEIGHT, src_h >> 1 );
    H264_WR_REG(id, tmpVal, VDO_H264, SRC_BF_HEIGHT);

#if (BL80X_HW_VER >= BL80X_HW_B0)
    /* need to assign Y/UV_SRCBF_SIZE in case src height is not mulitple of 16,
        or in direct link mode  */
    if (!IS_MULTIPULE_OF_16(src_h) || src_h < h) {
        H264_WR_REG(id, src_buf->yBufSize, VDO_H264, Y_SRCBF_SIZE);
        H264_WR_REG(id, src_buf->uvBufSize, VDO_H264, UV_SRCBF_SIZE);
    } else {
        H264_WR_REG(id, 0, VDO_H264, Y_SRCBF_SIZE);
        H264_WR_REG(id, 0, VDO_H264, UV_SRCBF_SIZE);
    }
#endif
}

void H264_SetSrcBufCtlCfg(Stream_ID_Type id, uint8_t numSrcFrm, uint32_t FrmYMemSize)
{
#if (BL80X_HW_VER >= BL80X_HW_B0)
    uint32_t tmpVal;
    uint32_t FrmCMemSize;
    
    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_SRC_CTRL);
    H264_SET_BITS_VAL(id, tmpVal, MFRM_BUF_EN, 0);
    H264_SET_BITS_VAL(id, tmpVal, FRM_BUF_NUM, 0);
    BL_WR_REG(H264_ENC_BASE, VDO_SRC_CTRL, tmpVal);

    if (numSrcFrm > 0) {
        /* byte cnt for single y/uv frame, used as y/uv frame address increment */
        FrmCMemSize = (FrmYMemSize >> 1);
        H264_WR_REG(id, FrmYMemSize, VDO_H264, Y_FRAME_MEM_SIZE);
        H264_WR_REG(id, FrmCMemSize, VDO_H264, UV_FRAME_MEM_SIZE);
    }
#endif
}

void H264_SetSrcChannel(Stream_ID_Type id, H264_Src_Chann_Cfg_Type *cfg)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_SRC_DVP_SEL);
    H264_SET_BITS_VAL(id, tmpVal, Y_DVP2AXI_SEL, cfg->y_src);
    H264_SET_BITS_VAL(id, tmpVal, UV_DVP2AXI_SEL, cfg->uv_src);
    BL_WR_REG(H264_ENC_BASE, VDO_SRC_DVP_SEL, tmpVal);
}

void H264_SetBitstreamBuf(Stream_ID_Type id, uint32_t bufAddr, uint32_t bufSize)
{
    /* check if buffer is aligned to 128 bytes boundary */
    CHECK_PARAM((bufAddr & AXI_BURST_INCR16_ALIGNMENT_MASK) == 0 );

    H264_WR_REG(id, bufAddr, VDO_H264, BS_BASE_ADDR);
#if H264_BSB_WORKAROUND
    H264_WR_REG(id, bufSize - 4, VDO_H264, BS_SIZE);
#else
    H264_WR_REG(id, bufSize, VDO_H264, BS_SIZE);
#endif
}

void H264_SetBitstreamBufThreshold(Stream_ID_Type id, uint32_t threshold)
{
    uint32_t tmpVal;

    H264_WR_REG(id, threshold, VDO_H264, BS_FULL_THR);
    H264_RD_REG(id, tmpVal, VDO_H264, BS_FULL_THR);
    //BL_LOGI("[INFO] bs_threshold val:%d\r\n", tmpVal);
}

void H264_GetBSTotalByte(Stream_ID_Type id, uint32_t *total_byte)
{
    uint32_t tmpVal;
    H264_RD_REG(id, tmpVal, VDO, TOTAL_BYTECOUNT);

    *total_byte = tmpVal;
}

