sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/bl808_h264.c
#if NEW_REF_FRM_CFG_API
void H264_SetRefFrmMemPlusExtData(Stream_ID_Type id, H264_REF_FRM_ADDR_S *ref_addr)
{
    H264_WR_REG(id, ref_addr->ref_y0_base_addr, VDO_H264, REFY0_BASE_ADDR);
    H264_WR_REG(id, ref_addr->ref_u0_base_addr, VDO_H264, REFU0_BASE_ADDR);
    H264_WR_REG(id, ref_addr->ref_v0_base_addr, VDO_H264, REFV0_BASE_ADDR);
    H264_WR_REG(id, ref_addr->ref_y1_base_addr, VDO_H264, REFY1_BASE_ADDR);
    H264_WR_REG(id, ref_addr->ref_u1_base_addr, VDO_H264, REFU1_BASE_ADDR);
    H264_WR_REG(id, ref_addr->ref_v1_base_addr, VDO_H264, REFV1_BASE_ADDR);
    H264_WR_REG(id, ref_addr->ext_dat_base_addr, VDO_H264, EXT_BASE_ADDR);
}
#else
void H264_SetRefFrmMemPlusExtData(Stream_ID_Type id, uint32_t ref_addr)
{
    H264_WR_REG(id, ref_addr, VDO_H264, REF_BASE_ADDR);
}
#endif

void H264_SetVUITimeScale(Stream_ID_Type id, uint32_t timeScale)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG32);
    H264_SET_BITS_VAL(id, tmpVal, VUI_TIME_SCALE_L, timeScale & 0xffff);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG32, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG33);
    H264_SET_BITS_VAL(id, tmpVal, VUI_TIME_SCALE_H, (timeScale>>16) & 0xffff);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG33, tmpVal);
}

void H264_SetVUINumUnitsInTick(Stream_ID_Type id, uint32_t numUnitsInTick)
{
    uint32_t tmpVal;
    
    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG34);
    H264_SET_BITS_VAL(id, tmpVal, VUI_NUM_U_TICK_L, numUnitsInTick & 0xffff);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG34, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG35);
    H264_SET_BITS_VAL(id, tmpVal, VUI_NUM_U_TICK_H, (numUnitsInTick>>16) & 0xffff);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG35, tmpVal);
}

void H264_UpdateSPS(Stream_ID_Type id)
{
#if (BL80X_HW_VER >= BL80X_HW_B0)
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_H264_ENCODER_CTRL);
    H264_SET_CFG_BITS_VAL(id, tmpVal, RC_GOP_UPD, 1);
    BL_WR_REG(H264_ENC_BASE, VDO_H264_ENCODER_CTRL, tmpVal);
#endif 
}

void H264_UpdateRC(Stream_ID_Type id)
{
#if (BL80X_HW_VER >= BL80X_HW_B0)
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_H264_ENCODER_CTRL);
    H264_SET_CFG_BITS_VAL(id, tmpVal, QR_UPD, 1);
    BL_WR_REG(H264_ENC_BASE, VDO_H264_ENCODER_CTRL, tmpVal);
#endif 
}

void H264_SetRateCtrlCfg(Stream_ID_Type id, const H264_RC_Cfg_Type *cfg)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG3);
    H264_SET_BITS_VAL(id, tmpVal, TARGET_I_QP, cfg->target_i_qp);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG3, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG5);
    H264_SET_BITS_VAL(id, tmpVal, TARGET_P_QP, cfg->target_p_qp);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG5, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG23);
    H264_SET_BITS_VAL(id, tmpVal, NUM_IMB_BITS, cfg->num_imb_bits);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG23, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG24);
    H264_SET_BITS_VAL(id, tmpVal, NUM_PMB_BITS, cfg->num_pmb_bits);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG24, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG31);
    H264_SET_BITS_VAL(id, tmpVal, IFRAME_MIN_QP, cfg->iframe_min_qp);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG31, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG31);
    H264_SET_BITS_VAL(id, tmpVal, IFRAME_MAX_QP, cfg->iframe_max_qp);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG31, tmpVal);
}

void H264_GetRateCtrlCfg(Stream_ID_Type id, H264_RC_Cfg_Type *cfg)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG3);
    H264_GET_BITS_VAL(id, tmpVal, TARGET_I_QP, cfg->target_i_qp);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG5);
    H264_GET_BITS_VAL(id, tmpVal, TARGET_P_QP, cfg->target_p_qp);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG23);
    H264_GET_BITS_VAL(id, tmpVal, NUM_IMB_BITS, cfg->num_imb_bits);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG24);
    H264_GET_BITS_VAL(id, tmpVal, NUM_PMB_BITS, cfg->num_pmb_bits);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG31);
    H264_GET_BITS_VAL(id, tmpVal, IFRAME_MIN_QP, cfg->iframe_min_qp);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG31);
    H264_GET_BITS_VAL(id, tmpVal, IFRAME_MAX_QP, cfg->iframe_max_qp);
}

void H264_SetRateCtrlQP(Stream_ID_Type id, int target_i_qp, int target_p_qp)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG3);
    H264_SET_BITS_VAL(id, tmpVal, TARGET_I_QP, target_i_qp);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG3, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG5);
    H264_SET_BITS_VAL(id, tmpVal, TARGET_P_QP, target_p_qp);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG5, tmpVal);
}

void H264_SetCoreSizeCfg(Stream_ID_Type id, H264_Core_Size_Cfg_Type *cfg)
{
    uint32_t tmpVal;

    CHECK_PARAM(cfg->ixsize > 0 && cfg->ixsize <= 1920);
    CHECK_PARAM(cfg->iysize > 0 && cfg->iysize <= 1600);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG1);
    H264_SET_BITS_VAL(id, tmpVal, IMG_WIDTH, cfg->ixsize);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG1, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG2);
    H264_SET_BITS_VAL(id, tmpVal, IMG_HEIGHT, cfg->iysize);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG2, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG6);
    H264_SET_BITS_VAL(id, tmpVal, MB_LINES, (BLK_CNT_16X16(cfg->iysize)/DEF_NUM_SLICES) - 1);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG6, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG17);
    H264_SET_BITS_VAL(id, tmpVal, FRAME1, cfg->luvsize);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG17, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG18);
    H264_SET_BITS_VAL(id, tmpVal, EXT_DATA, (cfg->luvsize*2));
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG18, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG19);
    H264_SET_BITS_VAL(id, tmpVal, EXT_MEM_CONFIG0, cfg->xsize32);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG19, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG20);
    H264_SET_BITS_VAL(id, tmpVal, EXT_MEM_CONFIG1, cfg->uvxsize32);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG20, tmpVal);

