sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/bl808_h264.c
    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG21);
    H264_SET_BITS_VAL(id, tmpVal, EXT_MEM_CONFIG2, cfg->lsize);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG21, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG22);
    H264_SET_BITS_VAL(id, tmpVal, EXT_MEM_CONFIG3, cfg->uvsize);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG22, tmpVal);
}

void H264_SetGOPSize(Stream_ID_Type id, uint32_t gopSize)
{
    uint32_t tmpVal;

    CHECK_PARAM(gopSize > 0 && gopSize < 300);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG8);
    H264_SET_BITS_VAL(id, tmpVal, NUM_PFRAMES, gopSize - 1);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG8, tmpVal);
}

void H264_SetProfile(Stream_ID_Type id, H264_Profile_Type profile)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG12);
    H264_SET_BITS_VAL(id, tmpVal, PROFILE_IDC, profile);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG12, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_H264_HWBACK_MODE);
    H264_SET_CFG_BITS_VAL(id, tmpVal, NAL_MP_MODE, profile);
    BL_WR_REG(H264_ENC_BASE, VDO_H264_HWBACK_MODE, tmpVal);
}

void H264_EnableDeblock(Stream_ID_Type id, BL_Fun_Type enable)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG9);
    H264_SET_BITS_VAL(id, tmpVal, DIS_FILTER, !enable);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG9, tmpVal);
}

void H264_SetDefaultCoreCfg(Stream_ID_Type id)
{
    int alpha_offset = 0;
    int beta_offset = 0;
    int chroma_qp_offset = 0;

    int constrained_ipred = 0;
    int nal_align = 0;

    int vui_timing_info = 1;

    int vui_fixed_frame_rate = 0;
    int sps_level_idc = 41;
    int aspect_ratio_info_present_flag = 0;
    int aspect_ratio_idc = 255;
    int aspect_ratio_width = 8;
    int aspect_ratio_height = 9;
    int idr_enable = 0;

    uint32_t tmpVal;

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG0);
    /* Encoder disabled */
    H264_SET_BITS_VAL(id, tmpVal, ENC_EN, 0);
    /* VUI aspect ratio information in SPS sent */
    H264_SET_BITS_VAL(id, tmpVal, VUI_ASPECT_INFO, aspect_ratio_info_present_flag);
    /* VUI fixed_frame_rate_flag sent if vui_timing_info is set to 1 */
    H264_SET_BITS_VAL(id, tmpVal, VUI_FIXED_F_RATE, vui_fixed_frame_rate);
    /* VUI timing information in SPS sent */
    H264_SET_BITS_VAL(id, tmpVal, VUI_TIMING_INFO, vui_timing_info);
    /* IDR and SPS and PPS sent at I-frame period */
    H264_SET_BITS_VAL(id, tmpVal, IDR_ENABLE, idr_enable);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG0, tmpVal);


    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG4);
    H264_SET_BITS_VAL(id, tmpVal, CQP_OFFSET, chroma_qp_offset);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG4, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG7);
    H264_SET_BITS_VAL(id, tmpVal, NUM_SLICES, DEF_NUM_SLICES - 1);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG7, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG10);
    H264_SET_BITS_VAL(id, tmpVal, ALPHA_OFF, alpha_offset);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG10, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG11);
    H264_SET_BITS_VAL(id, tmpVal, BETA_OFF, beta_offset);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG11, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG13);
    H264_SET_BITS_VAL(id, tmpVal, LEVEL_IDC, sps_level_idc);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG13, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG14);
    H264_SET_BITS_VAL(id, tmpVal, LUMA8X8_COST, 0x4);
    H264_SET_BITS_VAL(id, tmpVal, LUMA16X16_COST, 0x5);
    H264_SET_BITS_VAL(id, tmpVal, CHROMA8X8_COST, 0x3);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG14, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG16);
    H264_SET_BITS_VAL(id, tmpVal, FRAME0, 0);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG16, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG23);
    H264_SET_BITS_VAL(id, tmpVal, NAL_ALIGN, nal_align);
    H264_SET_BITS_VAL(id, tmpVal, CONS_IPRED, constrained_ipred);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG23, tmpVal); 

    //BL_LOGI("[enc %d] num_imb_bits %d, num_pmb_bits %d\r\n", id, cfg->num_imb_bits, cfg->num_pmb_bits);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG25);
    tmpVal = BL_CLR_REG_BIT(tmpVal, VDO_INTERLACE_MODE);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG25, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG28);
    H264_SET_BITS_VAL(id, tmpVal, PFRAME_MAX_QP, PFRAME_MAX_QP);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG28, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG30);
    H264_SET_BITS_VAL(id, tmpVal, RESET_I_STATE, 1);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG30, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG31);
    H264_SET_BITS_VAL(id, tmpVal, IFRAME_MAX_QP, IFRAME_MAX_QP);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG31, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG36);
    H264_SET_BITS_VAL(id, tmpVal, VUI_ASPECT_IDC, aspect_ratio_idc);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG36, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG37);
    H264_SET_BITS_VAL(id, tmpVal, VUI_ASPECT_WIDTH, aspect_ratio_width);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG37, tmpVal);

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG38);
    H264_SET_BITS_VAL(id, tmpVal, VUI_ASPECT_HEIGHT, aspect_ratio_height);
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG38, tmpVal);
}

void H264_StartEnc(Stream_ID_Type id, BL_Fun_Type sw_mode)
{
    uint32_t tmpVal;

#if (BL80X_HW_VER <= BL80X_HW_A0) 
        /* enable core enc to apply change of configure */
        tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG0);
        H264_SET_BITS_VAL(id, tmpVal, ENC_EN, 1);
        BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG0, tmpVal);
#endif

    if (ENABLE == sw_mode) {
        /* enable core enc to apply change of configure */
        tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG0);
        H264_SET_BITS_VAL(id, tmpVal, ENC_EN, 1);
        BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG0, tmpVal);
    }

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_H264_ENCODER_CTRL);
    if (ENABLE == sw_mode) {
        H264_SET_CFG_BITS_VAL(id, tmpVal, FRAME_START, 1);
    } else {
        H264_SET_CFG_BITS_VAL(id, tmpVal, ENC_SEQ_EN, 1);
    }
    BL_WR_REG(H264_ENC_BASE, VDO_H264_ENCODER_CTRL, tmpVal);
}

void H264_StopEnc(Stream_ID_Type id)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_H264_ENCODER_CTRL);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ENC_SEQ_EN, 0);
    BL_WR_REG(H264_ENC_BASE, VDO_H264_ENCODER_CTRL, tmpVal);
}

void H264_SetPrefetchMode(Stream_ID_Type id, BL_Fun_Type newState)
{
#if (BL80X_HW_VER >= BL80X_HW_B0)
    uint32_t tmpVal;

    H264_RD_REG(id, tmpVal, VDO_H264, PFCH_CTRL);
    H264_SET_CFG_BITS_VAL(id, tmpVal, PFCH_EN, ((newState == ENABLE) ? 0x01 : 0x00));
    H264_WR_REG(id, tmpVal, VDO_H264, PFCH_CTRL);
#endif
}

void H264_SetPrefetchCfg(Stream_ID_Type id, uint8_t mbHeight)
{
#if (BL80X_HW_VER >= BL80X_HW_B0)
    uint32_t tmpVal;

    H264_RD_REG(id, tmpVal, VDO_H264, PFCH_CTRL);
    H264_SET_CFG_BITS_VAL(id, tmpVal, PFCH_MBX_S, 0);
    H264_SET_CFG_BITS_VAL(id, tmpVal, PFCH_MBY_S, mbHeight - 3);
    H264_WR_REG(id, tmpVal, VDO_H264, PFCH_CTRL);
#endif
}

void H264_SetPrefetchBuffer(Stream_ID_Type id, uint32_t YRefAddr, uint32_t UVRefAddr)
{
    /* Y: image width × 80 */
    /* UV: (image width/2) ×40 */

