sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/bl808_h264.c
#if (BL80X_HW_VER >= BL80X_HW_B0)
    /* check if buffer is aligned to 128 bytes boundary */
    CHECK_PARAM((YRefAddr & AXI_BURST_INCR16_ALIGNMENT_MASK) == 0 );

    H264_WR_REG(id, YRefAddr, VDO_H264, PFCH_BASE);
    H264_WR_REG(id, UVRefAddr, VDO_H264, PFCHV_BASE);
#endif
}

void H264_IsCurrentPFrame(Stream_ID_Type id, BL_Sts_Type *status)
{
#if (BL80X_HW_VER >= BL80X_HW_B0)
    uint32_t tmpVal;

    H264_RD_REG(id, tmpVal, VDO, CORE_DBG2);
    H264_GET_BITS_VAL(id, tmpVal, PFRAME, *status);
#endif
}

void H264_EnableSPSOnEachGOP(Stream_ID_Type id, BL_Fun_Type newState)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_CORE_REG0);
    H264_SET_BITS_VAL(id, tmpVal, IDR_ENABLE, ((newState == ENABLE) ? 0x01 : 0x00));
    BL_WR_REG(H264_ENC_BASE, VDO_CORE_REG0, tmpVal);
}

void H264_EnableSramckModeOld(BL_Fun_Type newState)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_H264_HWBACK_MODE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, VDO_CFG_SRAMCK_MODE, newState);
    BL_WR_REG(H264_ENC_BASE, VDO_H264_HWBACK_MODE, tmpVal);
}

void H264_SetBufferSyncFlag(Stream_ID_Type id)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_H264_SRC_DBG);
    if (STREAM_0_ID == id) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, VDO_D2B_SYNC_EN, 0x1);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, VDO_S_D2B_SYNC_EN, 0x1);
    }
    BL_WR_REG(H264_ENC_BASE, VDO_H264_SRC_DBG, tmpVal);
}

uint16_t H264_GetYSrcHeight(Stream_ID_Type id)
{
    uint32_t tmpVal;
    uint16_t y_src_height = 0;

    H264_RD_REG(id, tmpVal, VDO_H264, SRC_BF_HEIGHT);
    H264_GET_CFG_BITS_VAL(id, tmpVal, Y_SRC_BF_HEIGHT, y_src_height);
    return y_src_height;
}

uint16_t H264_GetCSrcHeight(Stream_ID_Type id)
{
    uint32_t tmpVal;
    uint16_t c_src_height = 0;

    H264_RD_REG(id, tmpVal, VDO_H264, SRC_BF_HEIGHT);
    H264_GET_CFG_BITS_VAL(id, tmpVal, C_SRC_BF_HEIGHT, c_src_height);

    return c_src_height;
}

uint16_t H264_GetFrameHeight(Stream_ID_Type id)
{
    uint32_t tmpVal;
    uint16_t height = 0;

    H264_RD_REG(id, tmpVal, VDO_H264, FRAME_SIZE);
    H264_GET_CFG_BITS_VAL(id, tmpVal, FRAME_HEIGHT, height);

    return height;
}

uint16_t H264_GetFrameWidth(Stream_ID_Type id)
{
    uint32_t tmpVal;
    uint16_t width = 0;

    H264_RD_REG(id, tmpVal, VDO_H264, FRAME_SIZE);
    H264_GET_CFG_BITS_VAL(id, tmpVal, FRAME_WIDTH, width);

    return width;
}

void H264_SetBufferByteCnt(Stream_ID_Type id, uint32_t y_src_height,
                                     uint32_t c_src_height, uint32_t width)
{
   uint32_t tmpVal;
   uint32_t Val;

   H264_RD_REG(id, tmpVal, VDO_H264, Y_SRCBF_SIZE);
   Val = y_src_height * width;
   H264_SET_CFG_BITS_VAL(id, tmpVal, Y_SRCBF_BYCNT, Val);
   H264_WR_REG(id, tmpVal, VDO_H264, Y_SRCBF_SIZE);

   H264_RD_REG(id, tmpVal, VDO_H264, UV_SRCBF_SIZE);
   Val = c_src_height * width;
   H264_SET_CFG_BITS_VAL(id, tmpVal, UV_SRCBF_BYCNT, Val);
   H264_WR_REG(id, tmpVal, VDO_H264, UV_SRCBF_SIZE);
}

uint16_t H264_GetIntraMBCnt(Stream_ID_Type id)
{
    uint32_t val;

    H264_RD_REG(id, val, VDONR, IMBCNT);
    return val;
}

void H264_GetMbInfo(Stream_ID_Type id, H264_MB_Info_T *info)
{
    uint32_t tmpVal;
    
    H264_RD_REG(id, info->absmv_sum, VDONR, ABSMV_SUM);
    H264_RD_REG(id, tmpVal, VDONR, MVLEVEL);
    H264_GET_BITS_VAL(id, tmpVal, NZMV_MBCNT, info->nzmv_mbcnt);
    H264_RD_REG(id, info->intra_mbcnt, VDONR, IMBCNT);

}

void H264_RoiSetRoi0Coordinate(Stream_ID_Type id, H264_ROI_Coordinate_Info_T *coordinate_info)
{
    uint32_t tmpVal;
    uint8_t val;

    H264_RD_REG(id, tmpVal, VDO_H264, ROI0);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI0_MBX_S, coordinate_info->mbx_s);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI0_MBX_E, coordinate_info->mbx_e);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI0_MBY_S, coordinate_info->mby_s);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI0_MBY_E, coordinate_info->mby_e);
    H264_WR_REG(id, tmpVal, VDO_H264, ROI0);

    H264_RD_REG(id, tmpVal, VDO_H264, ROI_MODE);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI_EN, val);
    val = val | 0x1;
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI_EN, val);
    H264_WR_REG(id, tmpVal, VDO_H264, ROI_MODE);
}

void H264_RoiSetRoi1Coordinate(Stream_ID_Type id, H264_ROI_Coordinate_Info_T *coordinate_info)
{
    uint32_t tmpVal;
    uint8_t val;

    H264_RD_REG(id, tmpVal, VDO_H264, ROI1);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI1_MBX_S, coordinate_info->mbx_s);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI1_MBX_E, coordinate_info->mbx_e);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI1_MBY_S, coordinate_info->mby_s);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI1_MBY_E, coordinate_info->mby_e);
    H264_WR_REG(id, tmpVal, VDO_H264, ROI1);

    H264_RD_REG(id, tmpVal, VDO_H264, ROI_MODE);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI_EN, val);
    val = val | 0x2;
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI_EN, val);
    H264_WR_REG(id, tmpVal, VDO_H264, ROI_MODE);
}

void H264_RoiSetRoi2Coordinate(Stream_ID_Type id, H264_ROI_Coordinate_Info_T *coordinate_info)
{
    uint32_t tmpVal;
    uint8_t val;

    H264_RD_REG(id, tmpVal, VDO_H264, ROI2);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI2_MBX_S, coordinate_info->mbx_s);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI2_MBX_E, coordinate_info->mbx_e);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI2_MBY_S, coordinate_info->mby_s);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI2_MBY_E, coordinate_info->mby_e);
    H264_WR_REG(id, tmpVal, VDO_H264, ROI2);

    H264_RD_REG(id, tmpVal, VDO_H264, ROI_MODE);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI_EN, val);
    val = val | 0x4;
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI_EN, val);
    H264_WR_REG(id, tmpVal, VDO_H264, ROI_MODE);
}

void H264_RoiSetRoi3Coordinate(Stream_ID_Type id, H264_ROI_Coordinate_Info_T *coordinate_info)
{
    uint32_t tmpVal;
    uint8_t val;

    H264_RD_REG(id, tmpVal, VDO_H264, ROI3);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI3_MBX_S, coordinate_info->mbx_s);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI3_MBX_E, coordinate_info->mbx_e);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI3_MBY_S, coordinate_info->mby_s);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI3_MBY_E, coordinate_info->mby_e);
    H264_WR_REG(id, tmpVal, VDO_H264, ROI3);

    H264_RD_REG(id, tmpVal, VDO_H264, ROI_MODE);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI_EN, val);
    val = val | 0x8;
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI_EN, val);
    H264_WR_REG(id, tmpVal, VDO_H264, ROI_MODE);
}

void H264_RoiSetRoi4Coordinate(Stream_ID_Type id, H264_ROI_Coordinate_Info_T *coordinate_info)
{
    uint32_t tmpVal;
    uint8_t val;

    H264_RD_REG(id, tmpVal, VDO_H264, ROI4);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI4_MBX_S, coordinate_info->mbx_s);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI4_MBX_E, coordinate_info->mbx_e);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI4_MBY_S, coordinate_info->mby_s);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI4_MBY_E, coordinate_info->mby_e);
    H264_WR_REG(id, tmpVal, VDO_H264, ROI4);

    H264_RD_REG(id, tmpVal, VDO_H264, ROI_MODE);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI_EN, val);
    val = val | 0x10;
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI_EN, val);
    H264_WR_REG(id, tmpVal, VDO_H264, ROI_MODE);
}

void H264_RoiSetRoi5Coordinate(Stream_ID_Type id, H264_ROI_Coordinate_Info_T *coordinate_info)
{
    uint32_t tmpVal;
    uint8_t val;

    H264_RD_REG(id, tmpVal, VDO_H264, ROI5);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI5_MBX_S, coordinate_info->mbx_s);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI5_MBX_E, coordinate_info->mbx_e);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI5_MBY_S, coordinate_info->mby_s);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI5_MBY_E, coordinate_info->mby_e);
    H264_WR_REG(id, tmpVal, VDO_H264, ROI5);

    H264_RD_REG(id, tmpVal, VDO_H264, ROI_MODE);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI_EN, val);
    val = val | 0x20;
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI_EN, val);
    H264_WR_REG(id, tmpVal, VDO_H264, ROI_MODE);
}

