sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/bl808_h264.c
void H264_RoiSetRoi6Coordinate(Stream_ID_Type id, H264_ROI_Coordinate_Info_T *coordinate_info)
{
    uint32_t tmpVal;
    uint8_t val;

    H264_RD_REG(id, tmpVal, VDO_H264, ROI6);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI6_MBX_S, coordinate_info->mbx_s);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI6_MBX_E, coordinate_info->mbx_e);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI6_MBY_S, coordinate_info->mby_s);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI6_MBY_E, coordinate_info->mby_e);
    H264_WR_REG(id, tmpVal, VDO_H264, ROI6);

    H264_RD_REG(id, tmpVal, VDO_H264, ROI_MODE);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI_EN, val);
    val = val | 0x40;
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI_EN, val);
    H264_WR_REG(id, tmpVal, VDO_H264, ROI_MODE);
}

void H264_RoiSetRoi7Coordinate(Stream_ID_Type id, H264_ROI_Coordinate_Info_T *coordinate_info)
{
    uint32_t tmpVal;
    uint8_t val;

    H264_RD_REG(id, tmpVal, VDO_H264, ROI7);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI7_MBX_S, coordinate_info->mbx_s);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI7_MBX_E, coordinate_info->mbx_e);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI7_MBY_S, coordinate_info->mby_s);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI7_MBY_E, coordinate_info->mby_e);
    H264_WR_REG(id, tmpVal, VDO_H264, ROI7);

    H264_RD_REG(id, tmpVal, VDO_H264, ROI_MODE);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI_EN, val);
    val = val | 0x80;
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI_EN, val);
    H264_WR_REG(id, tmpVal, VDO_H264, ROI_MODE);
}

uint8_t  H264_RoiGetEnPositonVal(Stream_ID_Type id)
{
    uint32_t tmpVal;
    uint8_t val;

    H264_RD_REG(id, tmpVal, VDO_H264, ROI_MODE);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI_EN, val);

    return val;
}

void  H264_RoiResetEnPositonVal(Stream_ID_Type id)
{
    uint32_t tmpVal;

    H264_RD_REG(id, tmpVal, VDO_H264, ROI_MODE);
    H264_SET_CFG_BITS_VAL(id, tmpVal, ROI_EN, 0x0);
    H264_WR_REG(id, tmpVal, VDO_H264, ROI_MODE);
}

void H264_RoiGetRoi0Coordinate(Stream_ID_Type id, H264_ROI_Coordinate_Info_T *coordinate_info)
{
    uint32_t tmpVal;

    H264_RD_REG(id, tmpVal, VDO_H264, ROI0);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI0_MBX_S, coordinate_info->mbx_s);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI0_MBX_E, coordinate_info->mbx_e);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI0_MBY_S, coordinate_info->mby_s);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI0_MBY_E, coordinate_info->mby_e);
}

void H264_RoiGetRoi1Coordinate(Stream_ID_Type id, H264_ROI_Coordinate_Info_T *coordinate_info)
{
    uint32_t tmpVal;

    H264_RD_REG(id, tmpVal, VDO_H264, ROI1);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI1_MBX_S, coordinate_info->mbx_s);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI1_MBX_E, coordinate_info->mbx_e);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI1_MBY_S, coordinate_info->mby_s);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI1_MBY_E, coordinate_info->mby_e);
}

void H264_RoiGetRoi2Coordinate(Stream_ID_Type id, H264_ROI_Coordinate_Info_T *coordinate_info)
{
    uint32_t tmpVal;

    H264_RD_REG(id, tmpVal, VDO_H264, ROI2);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI2_MBX_S, coordinate_info->mbx_s);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI2_MBX_E, coordinate_info->mbx_e);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI2_MBY_S, coordinate_info->mby_s);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI2_MBY_E, coordinate_info->mby_e);
}

void H264_RoiGetRoi3Coordinate(Stream_ID_Type id, H264_ROI_Coordinate_Info_T *coordinate_info)
{
    uint32_t tmpVal;

    H264_RD_REG(id, tmpVal, VDO_H264, ROI3);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI3_MBX_S, coordinate_info->mbx_s);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI3_MBX_E, coordinate_info->mbx_e);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI3_MBY_S, coordinate_info->mby_s);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI3_MBY_E, coordinate_info->mby_e);
}

void H264_RoiGetRoi4Coordinate(Stream_ID_Type id, H264_ROI_Coordinate_Info_T *coordinate_info)
{
    uint32_t tmpVal;

    H264_RD_REG(id, tmpVal, VDO_H264, ROI4);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI4_MBX_S, coordinate_info->mbx_s);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI4_MBX_E, coordinate_info->mbx_e);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI4_MBY_S, coordinate_info->mby_s);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI4_MBY_E, coordinate_info->mby_e);
}

void H264_RoiGetRoi5Coordinate(Stream_ID_Type id, H264_ROI_Coordinate_Info_T *coordinate_info)
{
    uint32_t tmpVal;

    H264_RD_REG(id, tmpVal, VDO_H264, ROI5);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI5_MBX_S, coordinate_info->mbx_s);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI5_MBX_E, coordinate_info->mbx_e);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI5_MBY_S, coordinate_info->mby_s);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI5_MBY_E, coordinate_info->mby_e);
}

void H264_RoiGetRoi6Coordinate(Stream_ID_Type id, H264_ROI_Coordinate_Info_T *coordinate_info)
{
    uint32_t tmpVal;

    H264_RD_REG(id, tmpVal, VDO_H264, ROI6);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI6_MBX_S, coordinate_info->mbx_s);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI6_MBX_E, coordinate_info->mbx_e);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI6_MBY_S, coordinate_info->mby_s);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI6_MBY_E, coordinate_info->mby_e);
}

void H264_RoiGetRoi7Coordinate(Stream_ID_Type id, H264_ROI_Coordinate_Info_T *coordinate_info)
{
    uint32_t tmpVal;

    H264_RD_REG(id, tmpVal, VDO_H264, ROI7);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI7_MBX_S, coordinate_info->mbx_s);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI7_MBX_E, coordinate_info->mbx_e);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI7_MBY_S, coordinate_info->mby_s);
    H264_GET_CFG_BITS_VAL(id, tmpVal, ROI7_MBY_E, coordinate_info->mby_e);
}

void H264_RoiSetIBitRatio(Stream_ID_Type id, uint32_t bit_ratio)
{
    uint32_t tmpVal;

    H264_RD_REG(id, tmpVal, VDO_H264, ROI_BIT);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, VDO_CFG_IBIT_RATIO, bit_ratio);
    H264_WR_REG(id, tmpVal, VDO_H264, ROI_BIT);
}

void H264_RoiSetPBitRatio(Stream_ID_Type id, uint32_t bit_ratio)
{
    uint32_t tmpVal;

