sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/bl808_h264.c
    H264_RD_REG(id, tmpVal, VDO_H264, ROI_BIT);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, VDO_CFG_PBIT_RATIO, bit_ratio);
    H264_WR_REG(id, tmpVal, VDO_H264, ROI_BIT);
}

void H264_RoiSetN2RQPDecr(Stream_ID_Type id, uint32_t val)
{
    uint32_t tmpVal;

    H264_RD_REG(id, tmpVal, VDO_H264, ROI_QPTUNE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, VDO_CFG_N2R_QP_DECR, val);
    H264_WR_REG(id, tmpVal, VDO_H264, ROI_QPTUNE);
}

void H264_RoiSetIQPDecr(Stream_ID_Type id, uint32_t val)
{
    uint32_t tmpVal;

    H264_RD_REG(id, tmpVal, VDO_H264, ROI_QPTUNE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, VDO_CFG_IQP_DECR, val);
    H264_WR_REG(id, tmpVal, VDO_H264, ROI_QPTUNE);
}

void H264_RoiSetPQPDecr(Stream_ID_Type id, uint32_t val)
{
    uint32_t tmpVal;

    H264_RD_REG(id, tmpVal, VDO_H264, ROI_QPTUNE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, VDO_CFG_PQP_DECR, val);
    H264_WR_REG(id, tmpVal, VDO_H264, ROI_QPTUNE);
}
void H264_RoiSetIBitOfst(Stream_ID_Type id, uint32_t val)
{
    uint32_t tmpVal;

    H264_RD_REG(id, tmpVal, VDO_H264, ROI_BITTUNE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, VDO_CFG_ROI_IBIT_OFST, val);
    H264_WR_REG(id, tmpVal, VDO_H264, ROI_BITTUNE);
}
void H264_RoiSetPBitOfst(Stream_ID_Type id, uint32_t val)
{
    uint32_t tmpVal;

    H264_RD_REG(id, tmpVal, VDO_H264, ROI_BITTUNE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, VDO_CFG_ROI_PBIT_OFST, val);
    H264_WR_REG(id, tmpVal, VDO_H264, ROI_BITTUNE);
}
void H264_NRoiSetIBitOfst(Stream_ID_Type id, uint32_t val)
{
    uint32_t tmpVal;

    H264_RD_REG(id, tmpVal, VDO_H264, ROI_BITTUNE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, VDO_CFG_NROI_IBIT_OFST, val);
    H264_WR_REG(id, tmpVal, VDO_H264, ROI_BITTUNE);
}
void H264_NRoiSetPBitOfst(Stream_ID_Type id, uint32_t val)
{
    uint32_t tmpVal;

    H264_RD_REG(id, tmpVal, VDO_H264, ROI_BITTUNE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, VDO_CFG_NROI_PBIT_OFST, val);
    H264_WR_REG(id, tmpVal, VDO_H264, ROI_BITTUNE);
}

void H264_RoiEnableConfig(Stream_ID_Type id)
{
    uint32_t tmpVal;

    H264_RD_REG(id, tmpVal, VDO_H264, ROI_MODE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, VDO_CFG_ROI_UPD, 0x1);
    H264_WR_REG(id, tmpVal, VDO_H264, ROI_MODE);
}

void H264_NRSetVal(Stream_ID_Type id, int level, int strength)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDONR);
    H264_SET_BITS_VAL(id, tmpVal, NOISELEVEL, level);
    H264_SET_BITS_VAL(id, tmpVal, TEMPERALFILTERSTRENGTH, strength);
    BL_WR_REG(H264_ENC_BASE, VDONR, tmpVal);
}

void H264_NREnable(Stream_ID_Type id)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_H264_ENCODER_CTRL);
    H264_SET_CFG_BITS_VAL(id, tmpVal, VDONR_EN, 0x1);
    BL_WR_REG(H264_ENC_BASE, VDO_H264_ENCODER_CTRL, tmpVal);
}

void H264_MainPddingConfig(Stream_ID_Type id, BL_Fun_Type val)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_H264_ENCODER_CTRL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, VDO_CFG_ZSTUF_DIS, !val);
    BL_WR_REG(H264_ENC_BASE, VDO_H264_ENCODER_CTRL, tmpVal);
}

uint32_t H264_Get_Intterupt_Status(void)
{
    uint32_t ret = 0;
    uint32_t tmpVal;

    /* check if w/r buffer overflow */

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_H264_ENCODER_CTRL);
    H264_GET_CFG_BITS_VAL(STREAM_0_ID, tmpVal, ENC_SEQ_EN, tmpVal);
    if (tmpVal == 1) { // only check overflow in seq encode mode
        tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_SRC_R_DBG);
        if (BL_IS_REG_BIT_SET(tmpVal, VDO_SRC_WR_OV_RD)) {
            //BL_LOGE("[stream 0] sync buf overflow!\r\n");
            tmpVal = BL_SET_REG_BIT(0, VDO_SRC_Y_WOVR_CLR);
            tmpVal = BL_SET_REG_BIT(tmpVal, VDO_SRC_UV_WOVR_CLR);
            BL_WR_REG(H264_ENC_BASE, VDO_SRC_STA_CLR, tmpVal);
            ret = BL_BIT_SET(ret, H264_M_OVERFLOW);
        }
    }

    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_H264_ENCODER_CTRL);
    H264_GET_CFG_BITS_VAL(STREAM_1_ID, tmpVal, ENC_SEQ_EN, tmpVal);
    if (tmpVal == 1) { // only check overflow in seq encode mode
        tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_S_SRC_R_DBG);
        if (BL_IS_REG_BIT_SET(tmpVal, VDO_S_SRC_WR_OV_RD)) {
            //BL_LOGE("[stream 1] sync buf overflow!\r\n");
            tmpVal = BL_SET_REG_BIT(0, VDO_S_SRC_Y_WOVR_CLR);
            tmpVal = BL_SET_REG_BIT(tmpVal, VDO_S_SRC_UV_WOVR_CLR);
            BL_WR_REG(H264_ENC_BASE, VDO_SRC_STA_CLR, tmpVal);
            ret = BL_BIT_SET(ret, H264_S_OVERFLOW);
        }
    }

    /* check for interrupt */
    tmpVal = BL_RD_REG(H264_ENC_BASE, VDO_INT);
    
    /* clear interrupt status */
    BL_WR_REG(H264_ENC_BASE, VDO_INT_CLR, tmpVal);
    /* handle main stream */
    if (BL_IS_REG_BIT_SET(tmpVal, VDO_FRM_DONE_INT)) {
        ret = BL_BIT_SET(ret, H264_M_FRM_DONE_INT);
    }

    if (BL_IS_REG_BIT_SET(tmpVal, VDO_SEQ_DONE_INT)) {
        ret = BL_BIT_SET(ret, H264_M_SEQ_DONE_INT);
    }

    if (BL_IS_REG_BIT_SET(tmpVal, VDO_BS_FULL_INT)) {
        ret = BL_BIT_SET(ret, H264_M_BS_FULL_INT);
    }

    /* handle second stream */
    if (BL_IS_REG_BIT_SET(tmpVal, VDO_S_FRM_DONE_INT)) {
        ret = BL_BIT_SET(ret, H264_S_FRM_DONE_INT);
    }
    
    if (BL_IS_REG_BIT_SET(tmpVal, VDO_S_SEQ_DONE_INT)) {
        ret = BL_BIT_SET(ret, H264_S_SEQ_DONE_INT);
    }

    if (BL_IS_REG_BIT_SET(tmpVal, VDO_S_BS_FULL_INT)) {
        ret = BL_BIT_SET(ret, H264_S_BS_FULL_INT);
    }
    return ret;
}

void H264_RD_FRAME_BYTECOUNT_REG(uint32_t id, uint32_t *val)
{
    if (id==STREAM_0_ID) { 
        *val = BL_RD_REG(H264_ENC_BASE, VDO_FRAME_BYTECOUNT);
    } else {
        *val = BL_RD_REG(H264_ENC_BASE, VDO_S_FRAME_BYTECOUNT);
    }
}

